Revit 2027 API
RouteAnalysisSettings.GetRouteAnalysisSettings Method
 Returns the RouteAnalysisSettings element for a given document.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static RouteAnalysisSettings GetRouteAnalysisSettings(
	Document cda
)
Public Shared Function GetRouteAnalysisSettings (
	cda As Document
) As RouteAnalysisSettings
public:
static RouteAnalysisSettings^ GetRouteAnalysisSettings(
	Document^ cda
)
static member GetRouteAnalysisSettings :
        cda : Document -> RouteAnalysisSettings
Parameters
cda Document
 The document for which to get the RouteAnalysisSettings element.
Return Value
RouteAnalysisSettings
Returns the RouteAnalysisSettings element in project documents or null for family documents
.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Project documents have a RouteAnalysisSettings element, one per document. Family documents do not have RouteAnalysisSettings elements.
See Also
Reference
RouteAnalysisSettings Class
Autodesk.Revit.DB.Analysis Namespace